//package gold4;
//
///*
// * 매커니즘
// * 1. 미세먼지 확산: 미세먼지가 있는 곳에서 '네 방향'으로 확산되나 
// * 인접한 방향에 공청기가 있거나 칸이 없으면 확산 안됨
// * 또한 확산되는 양은 나누기 5이며 소수점은 버림. 확산시키고 남은 양은
// * => 그곳 미세먼지 - (미세먼지/5)*(확산된 방향 개수) 
// * !!!! -> 그곳 미세먼지에서 확산될 때마다 그곳 미세먼지/5를 계속 빼서 확산된 칸에 더하면 되겠군
// * =================
// * 2. 공청기 작동: 위쪽에서는 반시계 방향으로 바람이 순환하고 아래쪽에서는 시계방향으로 순환
// * 바람이 불면 미세먼지가 바람 방향대로 한 칸씩 이동
// * 공기청정기로 들어간 미세먼지는 사라짐. 
// * */
//public class B17144_미세먼지안녕 {
//
//	public static void main(String[] args) {
//		Scanner
//	}
//
//}
